2024-06-13-use-lute-v3.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ">
<title>use lute v3</title>

          <meta name="author" content="k">
          <meta name="referrer" content="no-referrer">
          <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
          <link href= "static/style.css" rel="stylesheet" type="text/css" />
          <link rel="icon" href="static/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
          <div class="header">
              <a href="index.html">HOMEPAGE 🏠 /</a>
              <a href="archive.html">ALL POSTS 📄 /</a>
              <a href="tags.html">ALL POSTS BY TAGS 🏷</a>
          </div>
</div>
<div id="content">
<div class="post-date">13 Jun 2024</div><h1 class="post-title"><a href="./2024-06-13-use-lute-v3.html">use lute v3</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9c13daa">Install lute</a>
<ul>
<li><a href="#org882f27e">Useing venv</a></li>
<li><a href="#org4a5a681">Install via pip</a></li>
<li><a href="#orga1d2b90">Starting in a virtual environment</a></li>
</ul>
</li>
<li><a href="#org7f9c0ad">Use lute</a>
<ul>
<li><a href="#org18e0def">Update</a></li>
<li><a href="#org5cf7677">Config</a>
<ul>
<li><a href="#org2d684af">Dicts</a></li>
<li><a href="#orgf47f6a4">Custom styles</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
LUTE = Learning Using Texts: learn languages through reading. Python/Flask.
</p>

<div id="outline-container-org9c13daa" class="outline-2">
<h2 id="org9c13daa">Install lute</h2>
<div class="outline-text-2" id="text-org9c13daa">
</div>
<div id="outline-container-org882f27e" class="outline-3">
<h3 id="org882f27e">Useing venv</h3>
<div class="outline-text-3" id="text-org882f27e">
<p>
Create a folder and enter it to create a Python virtual environment.
</p>
<div class="org-src-container">
<pre class="src src-shell">python -m venv envlute
</pre>
</div>
<p>
Execute the activation script in the <code>envlute\Scripts</code> folder according to the shell currently in use.
</p>
</div>
</div>
<div id="outline-container-org4a5a681" class="outline-3">
<h3 id="org4a5a681">Install via pip</h3>
<div class="outline-text-3" id="text-org4a5a681">
<div class="org-src-container">
<pre class="src src-shell">pip install lute3
</pre>
</div>
</div>
</div>
<div id="outline-container-orga1d2b90" class="outline-3">
<h3 id="orga1d2b90">Starting in a virtual environment</h3>
<div class="outline-text-3" id="text-orga1d2b90">
<div class="org-src-container">
<pre class="src src-shell">python -m lute.main
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7f9c0ad" class="outline-2">
<h2 id="org7f9c0ad">Use lute</h2>
<div class="outline-text-2" id="text-org7f9c0ad">
</div>
<div id="outline-container-org18e0def" class="outline-3">
<h3 id="org18e0def">Update</h3>
<div class="outline-text-3" id="text-org18e0def">
<div class="org-src-container">
<pre class="src src-shell">pip install --upgrade lute3
</pre>
</div>
</div>
</div>
<div id="outline-container-org5cf7677" class="outline-3">
<h3 id="org5cf7677">Config</h3>
<div class="outline-text-3" id="text-org5cf7677">
</div>
<div id="outline-container-org2d684af" class="outline-4">
<h4 id="org2d684af">Dicts</h4>
<div class="outline-text-4" id="text-org2d684af">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Name</td>
<td class="org-left">type</td>
<td class="org-left">Url</td>
</tr>

<tr>
<td class="org-left">collins</td>
<td class="org-left">en-zh</td>
<td class="org-left"><a href="https://www.collinsdictionary.com/dictionary/english-chinese/">https://www.collinsdictionary.com/dictionary/english-chinese/</a>###</td>
</tr>

<tr>
<td class="org-left">cambridge</td>
<td class="org-left">en-zh</td>
<td class="org-left"><a href="https://dictionary.cambridge.org/zhs/%E8%AF%8D%E5%85%B8/%E8%8B%B1%E8%AF%AD-%E6%B1%89%E8%AF%AD-%E7%AE%80%E4%BD%93/">https://dictionary.cambridge.org/zhs/%E8%AF%8D%E5%85%B8/%E8%8B%B1%E8%AF%AD-%E6%B1%89%E8%AF%AD-%E7%AE%80%E4%BD%93/</a>###</td>
</tr>

<tr>
<td class="org-left">bing</td>
<td class="org-left">en-zh</td>
<td class="org-left"><a href="https://www.bing.com/dict/">https://www.bing.com/dict/</a>###</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf47f6a4" class="outline-4">
<h4 id="orgf47f6a4">Custom styles</h4>
<div class="outline-text-4" id="text-orgf47f6a4">
<div class="org-src-container">
<pre class="src src-css">/* Custom css to modify Lute's appearance. */
body {
  font-family: "IBM Plex Serif", serif;
  font-style: normal;
  font-weight: 400;
  src: url(https://fonts.gstatic.com/s/ibmplexserif/v19/jizAREVNn1dOx-zrZ2X3pZvkTi2k_iI5q1vxiQ.woff2) format('woff2');
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-tutorial.html">tutorial</a> </div></div>
<div id="postamble" class="status"><center>λ @ 2024-2024</center></div>
</body>
</html>
